[
  {
    "Name": "Guitar Tabs",
    "Description": "This project, made with NextJS shows a list of songs and their respective chords timings. These songs show the associated chords for learning on guitar.",
    "Image": "guitar.png",
    "Link": "https://guitar-tabs.netlify.app/"
  },
  {
    "Name": "Vue Holidays",
    "Description": "A Vue project that shows the best days to book holidays, and maximise time off vs annual leave taken. The project uses the official National Holidays API, then calculates the best days from there.",
    "Image": "vue-calendar.png",
    "Link": "https://daystobook.netlify.app/"
  },
  {
    "Name": "PTO Tracker",
    "Description": "A Vue project that tracks holidays that are booked off work. Connects and stores values on a hosted AWS database. Can add/delete/update scheduled pto through the frontend.",
    "Image": "pto-tracker.png",
    "Link": "https://pto-tracker.netlify.app"
  },
  {
    "Name": "Rhythm-Based Runner",
    "Description": "This rhythm-based runner game was made in Unity and C#. The game was made with the intention of it being played on mobile devices, and so features a portrait game screen and simple swipe controls. Development for the game started in late November 2019, and completed development in March 2020.",
    "Image": "rhythm-runner.png",
    "Link": "https://github.com/DanRLBailey/mobile-rhythm-runner"
  },
  {
    "Name": "FYP",
    "Description": "The artefact for my Final Year Project of University. Originally made using UE4, but switched to using Unity half way through due to engine difficulties. This project was made with a focus on accessibility for motor impaired players, predominantly by using single input controls. These controls consisted of buttons, microphones, and a range of other input devices that were planned. Development for the project started in January 2020, and this build was completed in May 2020.",
    "Image": "fyp.png",
    "Link": "https://github.com/DanRLBailey/final-year-project"
  },
  {
    "Name": "D'Litas",
    "Description": "A cakes & catering company's ecommerce website. Made originally using HTML & CSS, then later converted to be compatible with wordpress.",
    "Image": "dlitas.png",
    "Link": "https://dlitas.netlify.app/"
  },
  {
    "Name": "Bullet Hell",
    "Description": "A game made during the first 6 weeks of the second year of university in the TGP (Technical Games Production) module. It was made using Unreal Engine 4 with mostly C++ and some blueprints.",
    "Image": "tgp.png",
    "Link": "https://github.com/DanRLBailey/TGPSolo"
  }
]
